package src.main.java;

import javax.swing.*;

public class Menu {

	public static void main(String[] args) {
		JOptionPane.showMessageDialog(null, "ΠΡΟΣΟΧΗ!"+ "\n" + "Ένας μαθητής  του τμήματος Β1 έχει διαγνωστεί θετικός στον Covid-19 και με βάση το πρωτόκολλο του ΕΟΔΥ για την διαχείριση του κορωνοϊου" 
				+"\n" +  "θα πρέπει να ακολουθηθούν τα παρακάτω μέτρα από τους μαθητές του τμήματος για την αποφυγή της διασποράς του ιού.\n" + 
				"\n" + 
				"Είναι υποχρεωτική η παραμονή των μαθητών σε καραντίνα διάρκειας 14 ημερών και επιστροφή τους στο σχολείο μετά το πέρας των 14 ημερών. \n" + 
				"\n" + 
				"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ο μαθητής εκδηλώσει συμπτώματα συμβατά με COVID-19, θα πρέπει να υποβληθεί σε εργαστηριακό έλεγχο."
				+"\n" + "Εάν το μοριακό τεστ είναι θετικό, αντιμετωπίζεται ως επιβεβαιωμένο περιστατικό." 
				+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου. \n" + 
				"\n" + 
				"Δε συνίσταται καθολικός εργαστηριακός έλεγχος των ασυμπτωματικών μαθητών. \n" + 
				"\n" + 
				"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ασυμπτωματικός μαθητής, κάνει με δική του πρωτοβουλία ή για εξατομικευμένους λόγους εργαστηριακό έλεγχο, τότε: "
				+"\n" + "Εάν το μοριακό τεστ είναι θετικό, παραμένει σε κατ’ οίκον απομόνωση για 10 ημέρες από την ημέρα διενέργειας του τεστ (εφόσον παραμένει ασυμπτωματικό). "
				+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου.\n" + 
				"\n" + 
				"Το τμήμα θα παραμείνει κλειστό για αυτές τις 14 ημερες και θα γίνει εντατικός καθαρισμός σε όλους τους χώρους. Μείνετε υγιείς!\n" + 
				"");
		String option = JOptionPane.showInputDialog("Καλωσήρθατε! Επιλέξτε ένα από τα παρακάτω:\n "
				+ "1. Γενικές Πληροφορίες για Sars-Cov-2.\n "
				+ "2. Στατιστικά Στοιχεία.\n "
				+ "3. Καταγραφή κρούσματος Μαθητή.\n "
				+ "4. Καταγραφή κρούσματος Καθηγητή.\n "
				+ "5. Χάρτες.\n "
				+ "6. Έξοδος.\n");
		JOptionPane.showMessageDialog(null, "ΠΡΟΣΟΧΗ!"+ "\n" + "Ένας Καθηγητής έχει διαγνωστεί ως θετικός στον Covid-19 και με βάση το πρωτόκολλο του ΕΟΔΥ για την διαχείριση του κορωνοϊου θα πρέπει να ακολουθηθούν" 
				+"\n" + "τα παρακάτω μέτρα για την αποφυγή της διασποράς του ιού από τους μαθητές των τμήματων Α2, Γ3 στα οποία είχε παρουσία τουλάχιστον" 
				+ "\n" + "2 διδακτικές ώρες, 48 ώρες πριν παρουσιάσει συμπτώματα του ιού.\n" + 
				"Είναι υποχρεωτική η παραμονή των μαθητών σε καραντίνα διάρκειας 14 ημερών και επιστροφή τους στο σχολείο μετά το πέρας των 14 ημερών. \n" + 
				"\n" + 
				"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ο μαθητής εκδηλώσει συμπτώματα συμβατά με COVID-19, θα πρέπει να υποβληθεί σε εργαστηριακό έλεγχο."
				+"\n" + "Εάν το μοριακό τεστ είναι θετικό, αντιμετωπίζεται ως επιβεβαιωμένο περιστατικό." 
				+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου. \n" + 
				"\n" + 
				"Δε συνίσταται καθολικός εργαστηριακός έλεγχος των ασυμπτωματικών μαθητών. \n" + 
				"\n" + 
				"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ασυμπτωματικός μαθητής, κάνει με δική του πρωτοβουλία ή για εξατομικευμένους λόγους εργαστηριακό έλεγχο, τότε: "
				+"\n" + "Εάν το μοριακό τεστ είναι θετικό, παραμένει σε κατ’ οίκον απομόνωση για 10 ημέρες από την ημέρα διενέργειας του τεστ (εφόσον παραμένει ασυμπτωματικό). "
				+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου.\n" + 
				"\n" + 
				"Τα τμήματα Α2, Γ3 θα παραμείνουν κλειστά για αυτές τις 14 ημερες και θα γίνει εντατικός καθαρισμός σε όλους τους χώρους. Μείνετε υγιείς!\n" + 
				"");
	}

}
