import javax.swing.*;
import java.awt.event.MouseAdapter;
import java.awt.event.MouseEvent;

public class Messages extends JFrame{
	
	private JPanel pmenu;
	private JFrame fmenu;
	String stmess = "ΠΡΟΣΟΧΗ!"+ "\n" + "Ένας μαθητής  του τμήματος Β1 έχει διαγνωστεί θετικός στον Covid-19 και με βάση το πρωτόκολλο του ΕΟΔΥ για την διαχείριση του κορωνοϊου" 
			+"\n" +  "θα πρέπει να ακολουθηθούν τα παρακάτω μέτρα από τους μαθητές του τμήματος για την αποφυγή της διασποράς του ιού.\n" + 
			"\n" + 
			"Είναι υποχρεωτική η παραμονή των μαθητών σε καραντίνα διάρκειας 14 ημερών και επιστροφή τους στο σχολείο μετά το πέρας των 14 ημερών. \n" + 
			"\n" + 
			"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ο μαθητής εκδηλώσει συμπτώματα συμβατά με COVID-19, θα πρέπει να υποβληθεί σε εργαστηριακό έλεγχο."
			+"\n" + "Εάν το μοριακό τεστ είναι θετικό, αντιμετωπίζεται ως επιβεβαιωμένο περιστατικό." 
			+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου. \n" + 
			"\n" + 
			"Δε συνίσταται καθολικός εργαστηριακός έλεγχος των ασυμπτωματικών μαθητών. \n" + 
			"\n" + 
			"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ασυμπτωματικός μαθητής, κάνει με δική του πρωτοβουλία ή για εξατομικευμένους λόγους εργαστηριακό έλεγχο, τότε: "
			+"\n" + "Εάν το μοριακό τεστ είναι θετικό, παραμένει σε κατ’ οίκον απομόνωση για 10 ημέρες από την ημέρα διενέργειας του τεστ (εφόσον παραμένει ασυμπτωματικό). "
			+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου.\n" + 
			"\n" + 
			"Το τμήμα θα παραμείνει κλειστό για αυτές τις 14 ημερες και θα γίνει εντατικός καθαρισμός σε όλους τους χώρους. Μείνετε υγιείς!\n" + 
			"";
	String tmess = "ΠΡΟΣΟΧΗ!"+ "\n" + "Ένας Καθηγητής έχει διαγνωστεί ως θετικός στον Covid-19 και με βάση το πρωτόκολλο του ΕΟΔΥ για την διαχείριση του κορωνοϊου θα πρέπει να ακολουθηθούν" 
			+"\n" + "τα παρακάτω μέτρα για την αποφυγή της διασποράς του ιού από τους μαθητές των τμήματων Α2, Γ3 στα οποία είχε παρουσία τουλάχιστον" 
			+ "\n" + "2 διδακτικές ώρες, 48 ώρες πριν παρουσιάσει συμπτώματα του ιού.\n" + 
			"Είναι υποχρεωτική η παραμονή των μαθητών σε καραντίνα διάρκειας 14 ημερών και επιστροφή τους στο σχολείο μετά το πέρας των 14 ημερών. \n" + 
			"\n" + 
			"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ο μαθητής εκδηλώσει συμπτώματα συμβατά με COVID-19, θα πρέπει να υποβληθεί σε εργαστηριακό έλεγχο."
			+"\n" + "Εάν το μοριακό τεστ είναι θετικό, αντιμετωπίζεται ως επιβεβαιωμένο περιστατικό." 
			+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου. \n" + 
			"\n" + 
			"Δε συνίσταται καθολικός εργαστηριακός έλεγχος των ασυμπτωματικών μαθητών. \n" + 
			"\n" + 
			"Εάν κατά τη διάρκεια της 14ήμερης καραντίνας, ασυμπτωματικός μαθητής, κάνει με δική του πρωτοβουλία ή για εξατομικευμένους λόγους εργαστηριακό έλεγχο, τότε: "
			+"\n" + "Εάν το μοριακό τεστ είναι θετικό, παραμένει σε κατ’ οίκον απομόνωση για 10 ημέρες από την ημέρα διενέργειας του τεστ (εφόσον παραμένει ασυμπτωματικό). "
			+"\n" + "Εάν το μοριακό τεστ είναι αρνητικό, παραμένει σε καραντίνα έως την ολοκλήρωση του 14ημέρου.\n" + 
			"\n" + 
			"Τα τμήματα Α2, Γ3 θα παραμείνουν κλειστά για αυτές τις 14 ημερες και θα γίνει εντατικός καθαρισμός σε όλους τους χώρους. Μείνετε υγιείς!\n" + 
			"";

	/**
	 * Create the frame.
	 */
	public Messages(Object o) {
		pmenu = new JPanel();
		fmenu = new JFrame();
		fmenu.setDefaultCloseOperation(JFrame.DISPOSE_ON_CLOSE);
		fmenu.setBounds(530, 240, 500, 300);
		fmenu.setVisible(true);
		fmenu.setTitle("Message Notification");
		fmenu.getContentPane().add(pmenu);
		pmenu.setLayout(null);
		/* Display the correct message according to the new case added (Student or Teacher) */
		if (o.equals("Student")) {
			JLabel lblNewLabel = new JLabel(stmess);
			lblNewLabel.setBounds(6, 6, 488, 243);
			pmenu.add(lblNewLabel);
		} else {
			JLabel lblNewLabel = new JLabel(tmess);
			lblNewLabel.setBounds(6, 6, 488, 243);
			pmenu.add(lblNewLabel);
		}
		
		JButton btnNewButton = new JButton("Send notification");
		btnNewButton.addMouseListener(new MouseAdapter() {
			@Override
			public void mouseClicked(MouseEvent e) {
				dispose();
				JOptionPane.showMessageDialog(null, "Notification sent to parents' and teachers' phones. \nStay safe!");
			}
		});
		btnNewButton.setBounds(180, 237, 138, 29);
		pmenu.add(btnNewButton);
		
	}
}
	